In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OneHotEncoder

import warnings
warnings.filterwarnings('ignore')

In [2]:
dados = {'Country': ['India', 'US', 'Japan', 'US', 'Japan'],
        'Age' : [44, 34, 46, 35, 23],
        'Salary' : [ 72000, 65000, 98000, 45000, 34000]}

df = pd.DataFrame(dados) 
df

  Country  Age  Salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

In [3]:
# handle_unknown = espeficica como as categorias desconhecidas s√£o tratadas durante o tranform.
enc = OneHotEncoder(handle_unknown='ignore')

In [4]:
enc_df = pd.DataFrame(enc.fit_transform(df[['Country']]).toarray())

In [5]:
enc_df

     0    1    2
0  1.0  0.0  0.0
1  0.0  0.0  1.0
2  0.0  1.0  0.0
3  0.0  0.0  1.0
4  0.0  1.0  0.0

In [6]:
df = df.join(enc_df)

In [7]:
df

  Country  Age  Salary    0    1    2
0   India   44   72000  1.0  0.0  0.0
1      US   34   65000  0.0  0.0  1.0
2   Japan   46   98000  0.0  1.0  0.0
3      US   35   45000  0.0  0.0  1.0
4   Japan   23   34000  0.0  1.0  0.0